import React from 'react';

function Terms() {

  return (
    <section className="conspect">
      <h1>Terms</h1>
      <h5>Кегль</h5>
      <p>Размер буквы или знака шрифта по вертикали, включающий её нижние и верхние выносные элементы; размер шрифта.</p>
      <h5>Интерлиньяж</h5>
      <p>(от французского interligne) Дословно переводится как «написанное между строк» и означает расстояние между двумя строками. Обычно принято устанавливать интерлиньяж на 1/5 часть больше кегля — так, при наборе 10-м кеглем интерлиньяж составляет 12 пунктов. В художественных целях интерлиньяж может быть увеличен или уменьшен, но поскольку от него зависит читаемость текста, то небольшой интерлиньяж применяется не часто — максимум, в заголовках.</p>
      <h5>Трекинг</h5>
      <p>(от английского tracking) Изменение межбуквенных пробелов с определённой целью: сделать текст более разреженным и светлым, или более плотным и темным. Ещё трекинг используется при вёрстке, чтобы увеличить или уменьшить количество строк, дабы избавиться от висячих предлогов, слов и строк. Хорошим тоном является числовое значение трекинга, не превышающее +/- 25.</p>
      <h5>Шестнадцатеричный формат цвета</h5>
      <p>Это способ представления цветов в вебе. Пример — #112233. Представление в виде трёх пар шестнадцатеричных цифр, где каждая пара отвечает за свой цвет: красный, зелёный, синий.</p>
      <h5>Плотность пикселей (ppi)</h5>
      <p>Это количество пикселей, вмещающееся в определённом физическом размере (обычно, в дюйме). На первом компьютере Mac было 72 пикселя на дюйм. Число кажется большим, но на самом деле это были огромные пиксели, под которые подходила не каждая графика. Большинство современных телефонов оснащены ретиновыми дисплеями, то есть дисплеями с повышенной плотностью пикселей.</p>
    </section>
  );
}
export default Terms;
